INSERT INTO buyer VALUES
    (1, 355464, 'Ларионов Дмитрий Валерьевич', '89637785422', NULL, 'Продавец-кассир'),
    (2, 354678, 'Харитонов Антон Вадимович', NULL, '"Сбербанк"', 'Менеджер'),
    (3, 355128, 'Зарьянова Татьяна Петрова', '89378786547', '"Сбербанк"', 'Оператор'),
    (4, 355129, 'Григорьев Вадим Борисович', '89888370389', '"Сбербанк"', 'Оператор'),
    (5, 353329, 'Партьянов Дмитрий Аркадьевич', '89636338712', '"БКК"', 'Продавец'),
    (6, 356644, 'Пушкина Екатерина Романовна', '89372346745', '"DNS"', 'Продавец-консультант');

INSERT INTO seller VALUES
    (1, 'user1', 'password1',  355676, 'Гордеев Алексей Игоревич', '89636543467'),
    (2, 'user2', 'password2',  354578, 'Ширенко Максим Сергеевич', '89635543689');

INSERT INTO apartment VALUES
    (1, 'Ерошевского', 72, 99, 'Кирпичный', NULL, 50, 38, 4),
    (2, 'Ново-Садовая', 320, 45, 'Панельный', 10, NULL, 50, NULL),
    (3, 'Демократическая', 55, 22, 'Кирпичный', 5, 55, 32, 3),
    (4, 'Ставропольская', 224, 12, 'Панельный', NULL, 45, 35, 3),
    (5, 'Авроры', 120, 38, NULL, 5, 66, 49, 3),
    (6, 'Дыбенко', 6, 60, 'Панельный', 11, 56, NULL, 4),
    (7, 'Ташкентская', 222, 44, 'Кирпичный', 12, 88, 64, NULL),
    (8, 'Лукачёва', 25, 66, NULL, 1, 38, 25, 3),
    (9, 'Проспект Кирова', 256, 111, 'Кирпичный', 6, 50, 38, 4),
    (10, 'Стара-Загора', 29, 111, 'Панельный', 6, 50, 38, 4);

INSERT INTO deal VALUES
    (1, 1, 1, 2, '2018-02-02', 2850000),
    (2, 2, 1, 5, '2018-02-20', 3120000),
    (3, 3, 1, 3, NULL, 4200000),
    (4, 4, 2, 1, '2018-12-02', 3850000),
    (5, 5, 2, 6, '2018-12-02', 2200000),
    (6, 6, 1, 4, NULL, 2530000),
    (7, 1, 2, 7, '2018-10-01', 3270000),
    (8, 3, 2,8, '2019-01-12', 2350000),
    (9, 4, 1, 9, '2018-03-05', 3650000),
    (10, 6, 2, 10, '2018-09-04', 2900000);